/*
 Navicat Premium Data Transfer

 Source Server         : 熊猫电子数据库
 Source Server Type    : MySQL
 Source Server Version : 50644
 Source Host           : 47.103.58.58:3306
 Source Schema         : ods_202509

 Target Server Type    : MySQL
 Target Server Version : 50644
 File Encoding         : 65001

 Date: 16/10/2025 16:25:23
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for dm_topic0304_input_research_task
-- ----------------------------
DROP TABLE IF EXISTS `dm_topic0304_input_research_task`;
CREATE TABLE `dm_topic0304_input_research_task`  (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `model_run_batch` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '模型运行批次标记',
  `lead_id` int(11) NOT NULL COMMENT '线索ID（关联dm_topic0404_input_lead.id）',
  `lead_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '线索名称（冗余便于检索）',
  `task_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '任务编码（选填）',
  `task_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '任务名称',
  `task_status` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT '待执行' COMMENT '任务状态：待执行/进行中/已完成/已取消',
  `executor_id` int(11) NULL DEFAULT NULL COMMENT '执行人ID',
  `executor_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '执行人',
  `task_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '任务内容/跟进要做的事情',
  `plan_start_time` datetime NULL DEFAULT NULL COMMENT '任务开始时间',
  `plan_finish_time` datetime NULL DEFAULT NULL COMMENT '预计完成时间',
  `real_finish_time` datetime NULL DEFAULT NULL COMMENT '实际完成时间',
  `remark` varchar(256) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '备注',
  `del_flag` int(1) NOT NULL DEFAULT 0 COMMENT '逻辑删除标识',
  `create_id` int(11) NOT NULL DEFAULT -1 COMMENT '创建者ID',
  `create_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '创建者姓名',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_id` int(11) NOT NULL DEFAULT -1 COMMENT '更新者ID',
  `update_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '更新者姓名',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_task_lead`(`lead_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1001 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '课题3-0304入参：调研策划任务' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of dm_topic0304_input_research_task
-- ----------------------------
INSERT INTO `dm_topic0304_input_research_task` VALUES (1, '20251013A', 127, NULL, NULL, '技术评估任务001', '已取消', NULL, '高峰', '任务内容：技术评估任务001', '2025-09-14 01:51:27', '2025-09-25 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (2, '20251013A', 171, NULL, NULL, '供应商拜访任务002', '待执行', NULL, '陈明', '任务内容：供应商拜访任务002', '2025-10-11 01:51:27', '2025-10-16 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (3, '20251013A', 357, NULL, NULL, '技术评估任务003', '待执行', NULL, '高峰', '任务内容：技术评估任务003', '2025-09-29 01:51:27', '2025-10-08 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (4, '20251013A', 63, NULL, NULL, '方案讨论任务004', '进行中', NULL, '黄丽', '任务内容：方案讨论任务004', '2025-10-01 01:51:27', '2025-10-14 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (5, '20251013A', 89, NULL, NULL, '市场调研任务005', '已取消', NULL, '黄丽', '任务内容：市场调研任务005', '2025-09-13 01:51:27', '2025-09-18 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (6, '20251013A', 439, NULL, NULL, '市场调研任务006', '已完成', NULL, '杨帆', '任务内容：市场调研任务006', '2025-09-26 01:51:27', '2025-10-09 01:51:27', '2025-10-09 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (7, '20251013A', 253, NULL, NULL, '技术评估任务007', '已取消', NULL, '杨帆', '任务内容：技术评估任务007', '2025-10-03 01:51:27', '2025-10-13 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (8, '20251013A', 200, NULL, NULL, '技术评估任务008', '已取消', NULL, '黄丽', '任务内容：技术评估任务008', '2025-09-28 01:51:27', '2025-10-13 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (9, '20251013A', 451, NULL, NULL, '市场调研任务009', '已取消', NULL, '杨帆', '任务内容：市场调研任务009', '2025-09-22 01:51:27', '2025-09-28 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (10, '20251013A', 403, NULL, NULL, '市场调研任务010', '已完成', NULL, '高峰', '任务内容：市场调研任务010', '2025-10-12 01:51:27', '2025-10-23 01:51:27', '2025-10-23 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (11, '20251013A', 350, NULL, NULL, '方案讨论任务011', '已取消', NULL, '周婷', '任务内容：方案讨论任务011', '2025-09-25 01:51:27', '2025-10-01 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (12, '20251013A', 237, NULL, NULL, '技术评估任务012', '待执行', NULL, '周婷', '任务内容：技术评估任务012', '2025-09-21 01:51:27', '2025-10-01 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (13, '20251013A', 269, NULL, NULL, '方案讨论任务013', '待执行', NULL, '周婷', '任务内容：方案讨论任务013', '2025-10-01 01:51:27', '2025-10-13 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (14, '20251013A', 456, NULL, NULL, '市场调研任务014', '已完成', NULL, '黄丽', '任务内容：市场调研任务014', '2025-10-10 01:51:27', '2025-10-24 01:51:27', '2025-10-24 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (15, '20251013A', 423, NULL, NULL, '技术评估任务015', '已完成', NULL, '杨帆', '任务内容：技术评估任务015', '2025-09-20 01:51:27', '2025-09-28 01:51:27', '2025-09-28 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (16, '20251013A', 67, NULL, NULL, '市场调研任务016', '已完成', NULL, '高峰', '任务内容：市场调研任务016', '2025-09-28 01:51:27', '2025-10-08 01:51:27', '2025-10-08 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (17, '20251013A', 269, NULL, NULL, '供应商拜访任务017', '进行中', NULL, '杨帆', '任务内容：供应商拜访任务017', '2025-09-22 01:51:27', '2025-10-07 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (18, '20251013A', 211, NULL, NULL, '方案讨论任务018', '已完成', NULL, '杨帆', '任务内容：方案讨论任务018', '2025-09-26 01:51:27', '2025-10-08 01:51:27', '2025-10-08 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (19, '20251013A', 470, NULL, NULL, '市场调研任务019', '进行中', NULL, '杨帆', '任务内容：市场调研任务019', '2025-09-30 01:51:27', '2025-10-10 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (20, '20251013A', 500, NULL, NULL, '供应商拜访任务020', '已取消', NULL, '高峰', '任务内容：供应商拜访任务020', '2025-10-09 01:51:27', '2025-10-21 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (21, '20251013A', 247, NULL, NULL, '市场调研任务021', '待执行', NULL, '杨帆', '任务内容：市场调研任务021', '2025-09-14 01:51:27', '2025-09-28 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (22, '20251013A', 436, NULL, NULL, '技术评估任务022', '待执行', NULL, '陈明', '任务内容：技术评估任务022', '2025-09-30 01:51:27', '2025-10-05 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (23, '20251013A', 206, NULL, NULL, '供应商拜访任务023', '已完成', NULL, '周婷', '任务内容：供应商拜访任务023', '2025-10-09 01:51:27', '2025-10-24 01:51:27', '2025-10-24 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (24, '20251013A', 164, NULL, NULL, '供应商拜访任务024', '待执行', NULL, '杨帆', '任务内容：供应商拜访任务024', '2025-09-18 01:51:27', '2025-10-01 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (25, '20251013A', 11, NULL, NULL, '方案讨论任务025', '已完成', NULL, '高峰', '任务内容：方案讨论任务025', '2025-09-21 01:51:27', '2025-09-28 01:51:27', '2025-09-28 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (26, '20251013A', 386, NULL, NULL, '方案讨论任务026', '待执行', NULL, '高峰', '任务内容：方案讨论任务026', '2025-10-06 01:51:27', '2025-10-17 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (27, '20251013A', 211, NULL, NULL, '市场调研任务027', '待执行', NULL, '高峰', '任务内容：市场调研任务027', '2025-09-24 01:51:27', '2025-10-04 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (28, '20251013A', 335, NULL, NULL, '方案讨论任务028', '进行中', NULL, '杨帆', '任务内容：方案讨论任务028', '2025-09-14 01:51:27', '2025-09-26 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (29, '20251013A', 180, NULL, NULL, '供应商拜访任务029', '已取消', NULL, '杨帆', '任务内容：供应商拜访任务029', '2025-09-22 01:51:27', '2025-09-29 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (30, '20251013A', 178, NULL, NULL, '供应商拜访任务030', '已完成', NULL, '黄丽', '任务内容：供应商拜访任务030', '2025-10-06 01:51:27', '2025-10-16 01:51:27', '2025-10-16 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (31, '20251013A', 133, NULL, NULL, '市场调研任务031', '已完成', NULL, '陈明', '任务内容：市场调研任务031', '2025-10-11 01:51:27', '2025-10-18 01:51:27', '2025-10-18 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (32, '20251013A', 92, NULL, NULL, '技术评估任务032', '待执行', NULL, '周婷', '任务内容：技术评估任务032', '2025-10-03 01:51:27', '2025-10-14 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (33, '20251013A', 286, NULL, NULL, '市场调研任务033', '已取消', NULL, '高峰', '任务内容：市场调研任务033', '2025-10-12 01:51:27', '2025-10-18 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (34, '20251013A', 407, NULL, NULL, '市场调研任务034', '已取消', NULL, '周婷', '任务内容：市场调研任务034', '2025-09-13 01:51:27', '2025-09-24 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (35, '20251013A', 434, NULL, NULL, '市场调研任务035', '已完成', NULL, '高峰', '任务内容：市场调研任务035', '2025-09-20 01:51:27', '2025-09-26 01:51:27', '2025-09-26 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (36, '20251013A', 367, NULL, NULL, '技术评估任务036', '进行中', NULL, '陈明', '任务内容：技术评估任务036', '2025-09-22 01:51:27', '2025-09-30 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (37, '20251013A', 408, NULL, NULL, '市场调研任务037', '已取消', NULL, '陈明', '任务内容：市场调研任务037', '2025-10-01 01:51:27', '2025-10-06 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (38, '20251013A', 438, NULL, NULL, '技术评估任务038', '进行中', NULL, '周婷', '任务内容：技术评估任务038', '2025-09-14 01:51:27', '2025-09-21 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (39, '20251013A', 121, NULL, NULL, '市场调研任务039', '进行中', NULL, '陈明', '任务内容：市场调研任务039', '2025-09-29 01:51:27', '2025-10-09 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (40, '20251013A', 413, NULL, NULL, '供应商拜访任务040', '已取消', NULL, '陈明', '任务内容：供应商拜访任务040', '2025-09-13 01:51:27', '2025-09-19 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (41, '20251013A', 350, NULL, NULL, '技术评估任务041', '已取消', NULL, '陈明', '任务内容：技术评估任务041', '2025-10-10 01:51:27', '2025-10-21 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (42, '20251013A', 214, NULL, NULL, '技术评估任务042', '已取消', NULL, '高峰', '任务内容：技术评估任务042', '2025-09-13 01:51:27', '2025-09-27 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (43, '20251013A', 192, NULL, NULL, '市场调研任务043', '进行中', NULL, '高峰', '任务内容：市场调研任务043', '2025-09-14 01:51:27', '2025-09-24 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (44, '20251013A', 282, NULL, NULL, '方案讨论任务044', '待执行', NULL, '杨帆', '任务内容：方案讨论任务044', '2025-10-03 01:51:27', '2025-10-11 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (45, '20251013A', 450, NULL, NULL, '供应商拜访任务045', '进行中', NULL, '黄丽', '任务内容：供应商拜访任务045', '2025-09-25 01:51:27', '2025-10-03 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (46, '20251013A', 460, NULL, NULL, '方案讨论任务046', '待执行', NULL, '高峰', '任务内容：方案讨论任务046', '2025-10-11 01:51:27', '2025-10-21 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (47, '20251013A', 301, NULL, NULL, '方案讨论任务047', '进行中', NULL, '高峰', '任务内容：方案讨论任务047', '2025-09-29 01:51:27', '2025-10-04 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (48, '20251013A', 312, NULL, NULL, '方案讨论任务048', '已完成', NULL, '杨帆', '任务内容：方案讨论任务048', '2025-09-20 01:51:27', '2025-09-27 01:51:27', '2025-09-27 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (49, '20251013A', 374, NULL, NULL, '技术评估任务049', '已完成', NULL, '周婷', '任务内容：技术评估任务049', '2025-10-11 01:51:27', '2025-10-22 01:51:27', '2025-10-22 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (50, '20251013A', 127, NULL, NULL, '方案讨论任务050', '已取消', NULL, '黄丽', '任务内容：方案讨论任务050', '2025-10-03 01:51:27', '2025-10-08 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (51, '20251013A', 26, NULL, NULL, '供应商拜访任务051', '已取消', NULL, '陈明', '任务内容：供应商拜访任务051', '2025-09-20 01:51:27', '2025-09-28 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (52, '20251013A', 62, NULL, NULL, '供应商拜访任务052', '进行中', NULL, '杨帆', '任务内容：供应商拜访任务052', '2025-09-29 01:51:27', '2025-10-09 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (53, '20251013A', 175, NULL, NULL, '技术评估任务053', '待执行', NULL, '周婷', '任务内容：技术评估任务053', '2025-10-05 01:51:27', '2025-10-18 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (54, '20251013A', 490, NULL, NULL, '方案讨论任务054', '待执行', NULL, '黄丽', '任务内容：方案讨论任务054', '2025-09-24 01:51:27', '2025-10-04 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (55, '20251013A', 464, NULL, NULL, '方案讨论任务055', '进行中', NULL, '高峰', '任务内容：方案讨论任务055', '2025-10-01 01:51:27', '2025-10-16 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (56, '20251013A', 491, NULL, NULL, '供应商拜访任务056', '进行中', NULL, '黄丽', '任务内容：供应商拜访任务056', '2025-10-02 01:51:27', '2025-10-09 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (57, '20251013A', 163, NULL, NULL, '技术评估任务057', '已完成', NULL, '杨帆', '任务内容：技术评估任务057', '2025-09-16 01:51:27', '2025-09-28 01:51:27', '2025-09-28 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (58, '20251013A', 64, NULL, NULL, '技术评估任务058', '进行中', NULL, '陈明', '任务内容：技术评估任务058', '2025-10-07 01:51:27', '2025-10-15 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (59, '20251013A', 262, NULL, NULL, '市场调研任务059', '待执行', NULL, '陈明', '任务内容：市场调研任务059', '2025-10-09 01:51:27', '2025-10-24 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (60, '20251013A', 462, NULL, NULL, '供应商拜访任务060', '待执行', NULL, '周婷', '任务内容：供应商拜访任务060', '2025-09-14 01:51:27', '2025-09-21 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (61, '20251013A', 231, NULL, NULL, '技术评估任务061', '进行中', NULL, '高峰', '任务内容：技术评估任务061', '2025-09-26 01:51:27', '2025-10-03 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (62, '20251013A', 463, NULL, NULL, '市场调研任务062', '已完成', NULL, '黄丽', '任务内容：市场调研任务062', '2025-09-29 01:51:27', '2025-10-10 01:51:27', '2025-10-10 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (63, '20251013A', 371, NULL, NULL, '方案讨论任务063', '已取消', NULL, '陈明', '任务内容：方案讨论任务063', '2025-09-17 01:51:27', '2025-09-27 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (64, '20251013A', 329, NULL, NULL, '供应商拜访任务064', '已完成', NULL, '高峰', '任务内容：供应商拜访任务064', '2025-10-12 01:51:27', '2025-10-17 01:51:27', '2025-10-17 01:51:27', '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (65, '20251013A', 112, NULL, NULL, '市场调研任务065', '待执行', NULL, '陈明', '任务内容：市场调研任务065', '2025-09-21 01:51:27', '2025-09-28 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (66, '20251013A', 57, NULL, NULL, '技术评估任务066', '待执行', NULL, '周婷', '任务内容：技术评估任务066', '2025-09-29 01:51:27', '2025-10-07 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (67, '20251013A', 333, NULL, NULL, '方案讨论任务067', '进行中', NULL, '黄丽', '任务内容：方案讨论任务067', '2025-10-07 01:51:27', '2025-10-17 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_research_task` VALUES (68, '20251013A', 255, NULL, NULL, '市场调研任务068', '已取消', NULL, '周婷', '任务内容：市场调研任务068', '2025-10-11 01:51:27', '2025-10-25 01:51:27', NULL, '自动生成任务数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');

SET FOREIGN_KEY_CHECKS = 1;
