/*
 Navicat Premium Data Transfer

 Source Server         : 熊猫电子数据库
 Source Server Type    : MySQL
 Source Server Version : 50644
 Source Host           : 47.103.58.58:3306
 Source Schema         : ods_202509

 Target Server Type    : MySQL
 Target Server Version : 50644
 File Encoding         : 65001

 Date: 16/10/2025 16:28:33
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for dm_topic0304_input_customer_base
-- ----------------------------
DROP TABLE IF EXISTS `dm_topic0304_input_customer_base`;
CREATE TABLE `dm_topic0304_input_customer_base`  (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `model_run_batch` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '模型运行批次标记',
  `customer_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '客户名称',
  `customer_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '客户编号',
  `customer_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '客户地址',
  `contact_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '客户联系人',
  `biz_owner_id` int(11) NULL DEFAULT NULL COMMENT '业务负责人ID',
  `biz_owner_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '业务负责人',
  `customer_type` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '客户类型',
  `hist_contract_cnt` int(11) NULL DEFAULT 0 COMMENT '历史合同数量',
  `hist_contract_amount` decimal(18, 2) NULL DEFAULT 0.00 COMMENT '历史合同金额(含税)',
  `received_amount` decimal(18, 2) NULL DEFAULT 0.00 COMMENT '回款金额',
  `overdue_amount` decimal(18, 2) NULL DEFAULT 0.00 COMMENT '逾期金额',
  `remark` varchar(256) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '备注',
  `del_flag` int(1) NOT NULL DEFAULT 0 COMMENT '逻辑删除标识',
  `create_id` int(11) NOT NULL DEFAULT -1 COMMENT '创建者ID',
  `create_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '创建者姓名',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_id` int(11) NOT NULL DEFAULT -1 COMMENT '更新者ID',
  `update_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '更新者姓名',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_customer_code_batch`(`customer_code`, `model_run_batch`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 201 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '课题3-0304入参：客户基础信息' ROW_FORMAT = Compact;

-- ----------------------------
-- Records of dm_topic0304_input_customer_base
-- ----------------------------
INSERT INTO `dm_topic0304_input_customer_base` VALUES (1, '20251013A', '华信科技有限公司001', 'CUST0001', '南京市雨花台区软件大道1号', '联系人001', NULL, '张伟', '潜在客户', 10, 476.79, 275.83, 200.96, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (2, '20251013A', '华信科技有限公司002', 'CUST0002', '南京市雨花台区软件大道2号', '联系人002', NULL, '张伟', '一般客户', 1, 200.97, 160.99, 39.98, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (3, '20251013A', '华信科技有限公司003', 'CUST0003', '南京市雨花台区软件大道3号', '联系人003', NULL, '刘洋', '一般客户', 10, 235.32, 205.19, 30.13, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (4, '20251013A', '华信科技有限公司004', 'CUST0004', '南京市雨花台区软件大道4号', '联系人004', NULL, '张伟', '一般客户', 2, 466.85, 302.29, 164.56, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (5, '20251013A', '华信科技有限公司005', 'CUST0005', '南京市雨花台区软件大道5号', '联系人005', NULL, '张伟', '潜在客户', 6, 285.32, 187.59, 97.73, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (6, '20251013A', '华信科技有限公司006', 'CUST0006', '南京市雨花台区软件大道6号', '联系人006', NULL, '张伟', '重点客户', 13, 107.11, 93.30, 13.81, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (7, '20251013A', '华信科技有限公司007', 'CUST0007', '南京市雨花台区软件大道7号', '联系人007', NULL, '李娜', '战略客户', 3, 292.48, 178.49, 113.99, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (8, '20251013A', '华信科技有限公司008', 'CUST0008', '南京市雨花台区软件大道8号', '联系人008', NULL, '赵敏', '潜在客户', 14, 117.73, 68.96, 48.77, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (9, '20251013A', '华信科技有限公司009', 'CUST0009', '南京市雨花台区软件大道9号', '联系人009', NULL, '李娜', '重点客户', 18, 65.75, 44.13, 21.62, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (10, '20251013A', '华信科技有限公司010', 'CUST0010', '南京市雨花台区软件大道10号', '联系人010', NULL, '赵敏', '潜在客户', 4, 495.29, 369.66, 125.63, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (11, '20251013A', '华信科技有限公司011', 'CUST0011', '南京市雨花台区软件大道11号', '联系人011', NULL, '张伟', '潜在客户', 1, 302.44, 159.85, 142.59, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (12, '20251013A', '华信科技有限公司012', 'CUST0012', '南京市雨花台区软件大道12号', '联系人012', NULL, '刘洋', '重点客户', 19, 446.40, 274.53, 171.87, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (13, '20251013A', '华信科技有限公司013', 'CUST0013', '南京市雨花台区软件大道13号', '联系人013', NULL, '张伟', '战略客户', 3, 69.50, 61.78, 7.72, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (14, '20251013A', '华信科技有限公司014', 'CUST0014', '南京市雨花台区软件大道14号', '联系人014', NULL, '王强', '重点客户', 19, 445.01, 324.92, 120.09, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (15, '20251013A', '华信科技有限公司015', 'CUST0015', '南京市雨花台区软件大道15号', '联系人015', NULL, '赵敏', '一般客户', 16, 29.39, 22.52, 6.87, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (16, '20251013A', '华信科技有限公司016', 'CUST0016', '南京市雨花台区软件大道16号', '联系人016', NULL, '刘洋', '潜在客户', 3, 411.20, 338.03, 73.17, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (17, '20251013A', '华信科技有限公司017', 'CUST0017', '南京市雨花台区软件大道17号', '联系人017', NULL, '李娜', '潜在客户', 3, 309.90, 210.17, 99.73, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (18, '20251013A', '华信科技有限公司018', 'CUST0018', '南京市雨花台区软件大道18号', '联系人018', NULL, '王强', '重点客户', 15, 381.71, 257.45, 124.26, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (19, '20251013A', '华信科技有限公司019', 'CUST0019', '南京市雨花台区软件大道19号', '联系人019', NULL, '张伟', '重点客户', 9, 465.26, 363.83, 101.43, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (20, '20251013A', '华信科技有限公司020', 'CUST0020', '南京市雨花台区软件大道20号', '联系人020', NULL, '李娜', '潜在客户', 1, 50.74, 34.97, 15.77, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (21, '20251013A', '华信科技有限公司021', 'CUST0021', '南京市雨花台区软件大道21号', '联系人021', NULL, '张伟', '一般客户', 13, 205.29, 142.96, 62.33, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (22, '20251013A', '华信科技有限公司022', 'CUST0022', '南京市雨花台区软件大道22号', '联系人022', NULL, '李娜', '一般客户', 7, 193.23, 124.35, 68.88, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (23, '20251013A', '华信科技有限公司023', 'CUST0023', '南京市雨花台区软件大道23号', '联系人023', NULL, '张伟', '一般客户', 15, 45.85, 40.05, 5.80, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (24, '20251013A', '华信科技有限公司024', 'CUST0024', '南京市雨花台区软件大道24号', '联系人024', NULL, '赵敏', '重点客户', 20, 269.83, 178.40, 91.43, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (25, '20251013A', '华信科技有限公司025', 'CUST0025', '南京市雨花台区软件大道25号', '联系人025', NULL, '刘洋', '一般客户', 7, 136.57, 74.13, 62.44, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (26, '20251013A', '华信科技有限公司026', 'CUST0026', '南京市雨花台区软件大道26号', '联系人026', NULL, '王强', '潜在客户', 14, 183.16, 101.32, 81.84, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (27, '20251013A', '华信科技有限公司027', 'CUST0027', '南京市雨花台区软件大道27号', '联系人027', NULL, '刘洋', '战略客户', 2, 433.48, 295.94, 137.54, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (28, '20251013A', '华信科技有限公司028', 'CUST0028', '南京市雨花台区软件大道28号', '联系人028', NULL, '刘洋', '潜在客户', 15, 351.50, 236.85, 114.65, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (29, '20251013A', '华信科技有限公司029', 'CUST0029', '南京市雨花台区软件大道29号', '联系人029', NULL, '李娜', '重点客户', 8, 79.73, 45.57, 34.16, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (30, '20251013A', '华信科技有限公司030', 'CUST0030', '南京市雨花台区软件大道30号', '联系人030', NULL, '张伟', '一般客户', 15, 219.16, 147.41, 71.75, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (31, '20251013A', '华信科技有限公司031', 'CUST0031', '南京市雨花台区软件大道31号', '联系人031', NULL, '刘洋', '战略客户', 7, 447.15, 359.49, 87.66, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (32, '20251013A', '华信科技有限公司032', 'CUST0032', '南京市雨花台区软件大道32号', '联系人032', NULL, '刘洋', '重点客户', 7, 450.34, 383.63, 66.71, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (33, '20251013A', '华信科技有限公司033', 'CUST0033', '南京市雨花台区软件大道33号', '联系人033', NULL, '赵敏', '战略客户', 12, 499.80, 420.82, 78.98, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (34, '20251013A', '华信科技有限公司034', 'CUST0034', '南京市雨花台区软件大道34号', '联系人034', NULL, '张伟', '潜在客户', 4, 207.81, 115.18, 92.63, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (35, '20251013A', '华信科技有限公司035', 'CUST0035', '南京市雨花台区软件大道35号', '联系人035', NULL, '李娜', '一般客户', 10, 150.87, 117.53, 33.34, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (36, '20251013A', '华信科技有限公司036', 'CUST0036', '南京市雨花台区软件大道36号', '联系人036', NULL, '张伟', '一般客户', 16, 176.49, 88.88, 87.61, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (37, '20251013A', '华信科技有限公司037', 'CUST0037', '南京市雨花台区软件大道37号', '联系人037', NULL, '张伟', '一般客户', 3, 50.81, 41.72, 9.09, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (38, '20251013A', '华信科技有限公司038', 'CUST0038', '南京市雨花台区软件大道38号', '联系人038', NULL, '王强', '战略客户', 10, 405.51, 260.70, 144.81, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (39, '20251013A', '华信科技有限公司039', 'CUST0039', '南京市雨花台区软件大道39号', '联系人039', NULL, '李娜', '重点客户', 13, 239.10, 164.32, 74.78, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (40, '20251013A', '华信科技有限公司040', 'CUST0040', '南京市雨花台区软件大道40号', '联系人040', NULL, '张伟', '潜在客户', 7, 361.85, 244.86, 116.99, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (41, '20251013A', '华信科技有限公司041', 'CUST0041', '南京市雨花台区软件大道41号', '联系人041', NULL, '李娜', '战略客户', 6, 150.71, 87.66, 63.05, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (42, '20251013A', '华信科技有限公司042', 'CUST0042', '南京市雨花台区软件大道42号', '联系人042', NULL, '王强', '战略客户', 13, 306.38, 242.14, 64.24, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (43, '20251013A', '华信科技有限公司043', 'CUST0043', '南京市雨花台区软件大道43号', '联系人043', NULL, '张伟', '重点客户', 19, 275.04, 140.63, 134.41, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (44, '20251013A', '华信科技有限公司044', 'CUST0044', '南京市雨花台区软件大道44号', '联系人044', NULL, '赵敏', '战略客户', 14, 112.29, 70.36, 41.93, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (45, '20251013A', '华信科技有限公司045', 'CUST0045', '南京市雨花台区软件大道45号', '联系人045', NULL, '张伟', '重点客户', 18, 288.95, 207.00, 81.95, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (46, '20251013A', '华信科技有限公司046', 'CUST0046', '南京市雨花台区软件大道46号', '联系人046', NULL, '李娜', '重点客户', 9, 360.83, 269.33, 91.50, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (47, '20251013A', '华信科技有限公司047', 'CUST0047', '南京市雨花台区软件大道47号', '联系人047', NULL, '王强', '潜在客户', 5, 453.10, 364.38, 88.72, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (48, '20251013A', '华信科技有限公司048', 'CUST0048', '南京市雨花台区软件大道48号', '联系人048', NULL, '王强', '重点客户', 10, 19.66, 17.37, 2.29, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (49, '20251013A', '华信科技有限公司049', 'CUST0049', '南京市雨花台区软件大道49号', '联系人049', NULL, '刘洋', '战略客户', 10, 244.08, 169.61, 74.47, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (50, '20251013A', '华信科技有限公司050', 'CUST0050', '南京市雨花台区软件大道50号', '联系人050', NULL, '刘洋', '重点客户', 2, 216.68, 156.78, 59.90, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (51, '20251013A', '华信科技有限公司051', 'CUST0051', '南京市雨花台区软件大道51号', '联系人051', NULL, '赵敏', '战略客户', 19, 291.21, 236.48, 54.73, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (52, '20251013A', '华信科技有限公司052', 'CUST0052', '南京市雨花台区软件大道52号', '联系人052', NULL, '刘洋', '战略客户', 15, 344.85, 266.67, 78.18, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (53, '20251013A', '华信科技有限公司053', 'CUST0053', '南京市雨花台区软件大道53号', '联系人053', NULL, '王强', '战略客户', 8, 291.63, 165.42, 126.21, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (54, '20251013A', '华信科技有限公司054', 'CUST0054', '南京市雨花台区软件大道54号', '联系人054', NULL, '赵敏', '重点客户', 9, 154.27, 94.75, 59.52, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (55, '20251013A', '华信科技有限公司055', 'CUST0055', '南京市雨花台区软件大道55号', '联系人055', NULL, '李娜', '潜在客户', 18, 432.90, 273.94, 158.96, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (56, '20251013A', '华信科技有限公司056', 'CUST0056', '南京市雨花台区软件大道56号', '联系人056', NULL, '李娜', '重点客户', 2, 125.05, 75.00, 50.05, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (57, '20251013A', '华信科技有限公司057', 'CUST0057', '南京市雨花台区软件大道57号', '联系人057', NULL, '王强', '潜在客户', 12, 280.77, 154.08, 126.69, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (58, '20251013A', '华信科技有限公司058', 'CUST0058', '南京市雨花台区软件大道58号', '联系人058', NULL, '王强', '一般客户', 12, 298.42, 260.16, 38.26, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (59, '20251013A', '华信科技有限公司059', 'CUST0059', '南京市雨花台区软件大道59号', '联系人059', NULL, '王强', '潜在客户', 9, 338.77, 251.77, 87.00, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (60, '20251013A', '华信科技有限公司060', 'CUST0060', '南京市雨花台区软件大道60号', '联系人060', NULL, '张伟', '潜在客户', 11, 384.82, 202.74, 182.08, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (61, '20251013A', '华信科技有限公司061', 'CUST0061', '南京市雨花台区软件大道61号', '联系人061', NULL, '赵敏', '潜在客户', 8, 305.18, 260.00, 45.18, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (62, '20251013A', '华信科技有限公司062', 'CUST0062', '南京市雨花台区软件大道62号', '联系人062', NULL, '赵敏', '战略客户', 5, 288.88, 190.09, 98.79, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (63, '20251013A', '华信科技有限公司063', 'CUST0063', '南京市雨花台区软件大道63号', '联系人063', NULL, '刘洋', '重点客户', 4, 497.67, 399.27, 98.40, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (64, '20251013A', '华信科技有限公司064', 'CUST0064', '南京市雨花台区软件大道64号', '联系人064', NULL, '张伟', '一般客户', 10, 142.55, 78.01, 64.54, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (65, '20251013A', '华信科技有限公司065', 'CUST0065', '南京市雨花台区软件大道65号', '联系人065', NULL, '李娜', '重点客户', 8, 116.91, 100.14, 16.77, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (66, '20251013A', '华信科技有限公司066', 'CUST0066', '南京市雨花台区软件大道66号', '联系人066', NULL, '李娜', '重点客户', 19, 198.13, 175.14, 22.99, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (67, '20251013A', '华信科技有限公司067', 'CUST0067', '南京市雨花台区软件大道67号', '联系人067', NULL, '王强', '一般客户', 9, 428.83, 322.98, 105.85, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (68, '20251013A', '华信科技有限公司068', 'CUST0068', '南京市雨花台区软件大道68号', '联系人068', NULL, '王强', '潜在客户', 8, 29.05, 16.65, 12.40, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (69, '20251013A', '华信科技有限公司069', 'CUST0069', '南京市雨花台区软件大道69号', '联系人069', NULL, '王强', '一般客户', 13, 200.33, 113.48, 86.85, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (70, '20251013A', '华信科技有限公司070', 'CUST0070', '南京市雨花台区软件大道70号', '联系人070', NULL, '赵敏', '一般客户', 4, 489.72, 334.52, 155.20, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (71, '20251013A', '华信科技有限公司071', 'CUST0071', '南京市雨花台区软件大道71号', '联系人071', NULL, '张伟', '战略客户', 5, 267.55, 213.64, 53.91, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (72, '20251013A', '华信科技有限公司072', 'CUST0072', '南京市雨花台区软件大道72号', '联系人072', NULL, '赵敏', '潜在客户', 11, 138.42, 104.21, 34.21, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (73, '20251013A', '华信科技有限公司073', 'CUST0073', '南京市雨花台区软件大道73号', '联系人073', NULL, '张伟', '战略客户', 1, 395.66, 319.80, 75.86, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (74, '20251013A', '华信科技有限公司074', 'CUST0074', '南京市雨花台区软件大道74号', '联系人074', NULL, '王强', '战略客户', 19, 365.11, 265.08, 100.03, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (75, '20251013A', '华信科技有限公司075', 'CUST0075', '南京市雨花台区软件大道75号', '联系人075', NULL, '王强', '战略客户', 7, 297.36, 188.75, 108.61, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (76, '20251013A', '华信科技有限公司076', 'CUST0076', '南京市雨花台区软件大道76号', '联系人076', NULL, '刘洋', '战略客户', 8, 450.03, 314.75, 135.28, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (77, '20251013A', '华信科技有限公司077', 'CUST0077', '南京市雨花台区软件大道77号', '联系人077', NULL, '赵敏', '潜在客户', 2, 96.16, 73.33, 22.83, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (78, '20251013A', '华信科技有限公司078', 'CUST0078', '南京市雨花台区软件大道78号', '联系人078', NULL, '李娜', '潜在客户', 12, 217.53, 111.14, 106.39, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (79, '20251013A', '华信科技有限公司079', 'CUST0079', '南京市雨花台区软件大道79号', '联系人079', NULL, '刘洋', '战略客户', 12, 322.06, 189.81, 132.25, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (80, '20251013A', '华信科技有限公司080', 'CUST0080', '南京市雨花台区软件大道80号', '联系人080', NULL, '李娜', '潜在客户', 20, 44.02, 35.63, 8.39, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (81, '20251013A', '华信科技有限公司081', 'CUST0081', '南京市雨花台区软件大道81号', '联系人081', NULL, '李娜', '重点客户', 14, 440.05, 315.61, 124.44, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (82, '20251013A', '华信科技有限公司082', 'CUST0082', '南京市雨花台区软件大道82号', '联系人082', NULL, '赵敏', '战略客户', 17, 298.09, 251.55, 46.54, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (83, '20251013A', '华信科技有限公司083', 'CUST0083', '南京市雨花台区软件大道83号', '联系人083', NULL, '李娜', '战略客户', 6, 285.66, 145.60, 140.06, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (84, '20251013A', '华信科技有限公司084', 'CUST0084', '南京市雨花台区软件大道84号', '联系人084', NULL, '赵敏', '重点客户', 8, 379.37, 248.38, 130.99, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (85, '20251013A', '华信科技有限公司085', 'CUST0085', '南京市雨花台区软件大道85号', '联系人085', NULL, '王强', '重点客户', 3, 258.39, 161.00, 97.39, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (86, '20251013A', '华信科技有限公司086', 'CUST0086', '南京市雨花台区软件大道86号', '联系人086', NULL, '王强', '一般客户', 4, 90.47, 71.77, 18.70, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (87, '20251013A', '华信科技有限公司087', 'CUST0087', '南京市雨花台区软件大道87号', '联系人087', NULL, '李娜', '一般客户', 12, 12.23, 8.84, 3.39, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (88, '20251013A', '华信科技有限公司088', 'CUST0088', '南京市雨花台区软件大道88号', '联系人088', NULL, '王强', '战略客户', 13, 262.84, 146.88, 115.96, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (89, '20251013A', '华信科技有限公司089', 'CUST0089', '南京市雨花台区软件大道89号', '联系人089', NULL, '李娜', '战略客户', 20, 241.09, 175.45, 65.64, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (90, '20251013A', '华信科技有限公司090', 'CUST0090', '南京市雨花台区软件大道90号', '联系人090', NULL, '李娜', '战略客户', 15, 46.53, 35.75, 10.78, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (91, '20251013A', '华信科技有限公司091', 'CUST0091', '南京市雨花台区软件大道91号', '联系人091', NULL, '王强', '一般客户', 17, 38.58, 33.74, 4.84, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (92, '20251013A', '华信科技有限公司092', 'CUST0092', '南京市雨花台区软件大道92号', '联系人092', NULL, '赵敏', '重点客户', 5, 264.63, 185.79, 78.84, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (93, '20251013A', '华信科技有限公司093', 'CUST0093', '南京市雨花台区软件大道93号', '联系人093', NULL, '李娜', '潜在客户', 14, 273.68, 159.60, 114.08, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (94, '20251013A', '华信科技有限公司094', 'CUST0094', '南京市雨花台区软件大道94号', '联系人094', NULL, '李娜', '一般客户', 6, 440.33, 367.34, 72.99, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (95, '20251013A', '华信科技有限公司095', 'CUST0095', '南京市雨花台区软件大道95号', '联系人095', NULL, '王强', '战略客户', 13, 438.63, 365.03, 73.60, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (96, '20251013A', '华信科技有限公司096', 'CUST0096', '南京市雨花台区软件大道96号', '联系人096', NULL, '赵敏', '潜在客户', 2, 20.54, 12.00, 8.54, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (97, '20251013A', '华信科技有限公司097', 'CUST0097', '南京市雨花台区软件大道97号', '联系人097', NULL, '刘洋', '一般客户', 16, 243.97, 199.75, 44.22, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (98, '20251013A', '华信科技有限公司098', 'CUST0098', '南京市雨花台区软件大道98号', '联系人098', NULL, '王强', '战略客户', 17, 63.35, 38.62, 24.73, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');
INSERT INTO `dm_topic0304_input_customer_base` VALUES (99, '20251013A', '华信科技有限公司099', 'CUST0099', '南京市雨花台区软件大道99号', '联系人099', NULL, '赵敏', '一般客户', 7, 294.20, 187.82, 106.38, '自动生成客户数据', 0, -1, '系统生成', '2025-10-13 01:51:27', -1, '系统生成', '2025-10-13 01:51:27');

SET FOREIGN_KEY_CHECKS = 1;
