/*
 Navicat Premium Data Transfer

 Source Server         : ROOT
 Source Server Type    : MySQL
 Source Server Version : 90300
 Source Host           : localhost:3306
 Source Schema         : sys

 Target Server Type    : MySQL
 Target Server Version : 90300
 File Encoding         : 65001

 Date: 16/09/2025 09:45:27
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for dm_topic0402_input_train_maintenance
-- ----------------------------
DROP TABLE IF EXISTS `dm_topic0402_input_train_maintenance`;
CREATE TABLE `dm_topic0402_input_train_maintenance`  (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `model_run_batch` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '模型运行批次标记',
  `train_id` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '列车编号/车组号',
  `carriage_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '车厢号',
  `repair_order_id` int NOT NULL COMMENT '维修单主键ID',
  `repair_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '维修工单编码',
  `fault_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '故障代码',
  `fault_description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '故障现象描述',
  `system_module` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '所属系统/模块，如制动系统、受电弓系统',
  `maintenance_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '维保类别：定检、临修、加改修',
  `maintenance_status` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '维保状态：进行中、已完成、已取消',
  `reporter` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '报修人',
  `report_date` datetime NULL DEFAULT NULL COMMENT '报修日期',
  `report_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL COMMENT '报修内容',
  `station_location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '所在站点/车间',
  `responsible_team` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '责任班组',
  `responsible_person` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '责任人',
  `responsible_contact` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '责任人联系方式',
  `last_maintenance_date` datetime NULL DEFAULT NULL COMMENT '上次维保日期',
  `maintenance_result` int NULL DEFAULT NULL COMMENT '维保结果 1成功 2失败',
  `end_time` datetime NULL DEFAULT NULL COMMENT '完成时间',
  `begin_time` datetime NULL DEFAULT NULL COMMENT '开始时间',
  `receive_time` datetime NULL DEFAULT NULL COMMENT '派工时间',
  `updater` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '更新人',
  `update_time` datetime NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `del_flag` int NOT NULL DEFAULT 0 COMMENT '逻辑删除标识',
  `remark` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '备注',
  `create_id` int NOT NULL DEFAULT -1 COMMENT '创建者ID',
  `create_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '创建者姓名',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_id` int NOT NULL DEFAULT -1 COMMENT '更新者ID',
  `update_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '更新者姓名',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1001 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci COMMENT = '课题4高铁运维入参-列车维修保养记录' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of dm_topic0402_input_train_maintenance
-- ----------------------------
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (1, '2025-09-08_TSY_0402_A', 'CRH380A-2061', '06车', 900000, 'RM-2025-900000', 'F-2190', '牵引系统出现异常：代码F-2190。', '牵引系统', '临修', '已取消', '王二', '2025-08-08 08:18:00', '王二反馈牵引系统波动，需临修处理。', '广州检修库B', '信号维护组', '王工', '13800000029', '2025-06-13 08:18:00', 2, NULL, '2025-08-08 11:45:00', '2025-08-08 09:47:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (2, '2025-09-08_TSY_0402_A', 'CR200J-2029', '06车', 900001, 'RM-2025-900001', 'F-2519', '制动管路出现异常：代码F-2519。', '制动管路', '定检', '已完成', '刘三', '2025-08-22 08:16:00', '刘三反馈制动管路波动，需定检处理。', '线路应急库', '信号维护组', '郝工', '13800000022', '2025-06-22 08:16:00', 1, '2025-08-22 13:30:00', '2025-08-22 10:36:00', '2025-08-22 09:17:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (3, '2025-09-08_TSY_0402_A', 'CRH380A-2014', '05车', 900002, 'RM-2025-900002', 'F-2888', '制动管路出现异常：代码F-2888。', '制动管路', '临修', '进行中', '钱七', '2025-06-03 05:02:00', '钱七反馈制动管路波动，需临修处理。', '唐山检修库A', '牵引系统班', '李工', '13800000029', '2025-04-04 05:02:00', NULL, NULL, '2025-06-03 07:26:00', '2025-06-03 06:05:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (4, '2025-09-08_TSY_0402_A', 'CR400BF-2076', '02车', 900003, 'RM-2025-900003', 'F-3824', '车门系统出现异常：代码F-3824。', '车门系统', '临修', '进行中', '王五', '2025-06-21 09:15:00', '王五反馈车门系统波动，需临修处理。', '沈阳检修库', '车门检修班', '刘工', '13800000024', '2025-03-23 09:15:00', NULL, NULL, '2025-06-21 10:45:00', '2025-06-21 09:25:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (5, '2025-09-08_TSY_0402_A', 'CR200J-2069', '01车', 900004, 'RM-2025-900004', 'F-8165', '空调系统出现异常：代码F-8165。', '空调系统', '临修', '进行中', '陈四', '2025-08-29 10:20:00', '陈四反馈空调系统波动，需临修处理。', '沈阳检修库', '转向架二班', '李工', '13800000023', '2025-06-16 10:20:00', NULL, NULL, '2025-08-29 13:48:00', '2025-08-29 11:50:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (6, '2025-09-08_TSY_0402_A', 'CRH6A-2087', '15车', 900005, 'RM-2025-900005', 'F-2997', '制动系统出现异常：代码F-2997。', '制动系统', '临修', '已完成', '王二', '2025-06-20 04:08:00', '王二反馈制动系统波动，需临修处理。', '唐山检修库A', '车门检修班', '王工', '13800000029', '2025-04-03 04:08:00', 1, '2025-06-20 07:43:00', '2025-06-20 05:27:00', '2025-06-20 04:48:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (7, '2025-09-08_TSY_0402_A', 'CRH6A-2070', '16车', 900006, 'RM-2025-900006', 'F-9762', '受电弓系统出现异常：代码F-9762。', '受电弓系统', '定检', '已完成', '李四', '2025-08-02 01:02:00', '李四反馈受电弓系统波动，需定检处理。', '唐山检修库A', '制动一班', '刘工', '13800000025', '2025-06-18 01:02:00', 1, '2025-08-02 06:03:00', '2025-08-02 04:04:00', '2025-08-02 02:00:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (8, '2025-09-08_TSY_0402_A', 'CR400BF-2051', '12车', 900007, 'RM-2025-900007', 'F-3542', '车载网络出现异常：代码F-3542。', '车载网络', '定检', '进行中', '孙八', '2025-07-29 10:03:00', '孙八反馈车载网络波动，需定检处理。', '线路应急库', '牵引系统班', '刘工', '13800000028', '2025-05-27 10:03:00', NULL, NULL, '2025-07-29 11:48:00', '2025-07-29 10:19:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (9, '2025-09-08_TSY_0402_A', 'CRH6A-2033', '15车', 900008, 'RM-2025-900008', 'F-5028', '制动系统出现异常：代码F-5028。', '制动系统', '临修', '进行中', '周九', '2025-07-08 05:46:00', '周九反馈制动系统波动，需临修处理。', '线路应急库', '车门检修班', '王工', '13800000027', '2025-06-22 05:46:00', NULL, NULL, '2025-07-08 08:59:00', '2025-07-08 06:44:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (10, '2025-09-08_TSY_0402_A', 'CR200J-2029', '06车', 900009, 'RM-2025-900009', 'F-6899', '信号通信出现异常：代码F-6899。', '信号通信', '临修', '已完成', '赵六', '2025-06-26 02:50:00', '赵六反馈信号通信波动，需临修处理。', '广州检修库B', '受电弓一班', '郝工', '13800000027', '2025-05-08 02:50:00', 1, '2025-06-26 12:39:00', '2025-06-26 05:37:00', '2025-06-26 03:20:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (11, '2025-09-08_TSY_0402_A', 'CR400AF-2093', '11车', 900010, 'RM-2025-900010', 'F-7462', '转向架系统出现异常：代码F-7462。', '转向架系统', '定检', '已取消', '钱七', '2025-06-13 01:10:00', '钱七反馈转向架系统波动，需定检处理。', '沈阳检修库', '空调保养班', '周工', '13800000026', '2025-03-21 01:10:00', 2, NULL, '2025-06-13 03:48:00', '2025-06-13 01:34:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (12, '2025-09-08_TSY_0402_A', 'CRH6A-2024', '02车', 900011, 'RM-2025-900011', 'F-8013', '制动管路出现异常：代码F-8013。', '制动管路', '定检', '已完成', '杨五', '2025-08-03 09:48:00', '杨五反馈制动管路波动，需定检处理。', '成都检修库', '制动一班', '董工', '13800000024', '2025-06-27 09:48:00', 1, '2025-08-03 16:42:00', '2025-08-03 12:10:00', '2025-08-03 11:08:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (13, '2025-09-08_TSY_0402_A', 'CR400AF-2020', '14车', 900012, 'RM-2025-900012', 'F-2678', '空调系统出现异常：代码F-2678。', '空调系统', '定检', '已取消', '刘三', '2025-08-06 01:18:00', '刘三反馈空调系统波动，需定检处理。', '广州检修库B', '空调保养班', '何工', '13800000023', '2025-06-12 01:18:00', 2, '2025-08-06 03:58:00', '2025-08-06 03:58:00', '2025-08-06 02:09:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (14, '2025-09-08_TSY_0402_A', 'CR400BF-2051', '01车', 900013, 'RM-2025-900013', 'F-2603', '制动管路出现异常：代码F-2603。', '制动管路', '加改修', '已取消', '周九', '2025-08-27 01:46:00', '周九反馈制动管路波动，需加改修处理。', '上海检修库', '受电弓一班', '周工', '13800000028', '2025-08-09 01:46:00', 2, '2025-08-27 02:33:00', '2025-08-27 02:33:00', '2025-08-27 01:57:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (15, '2025-09-08_TSY_0402_A', 'CR400AF-2055', '03车', 900014, 'RM-2025-900014', 'F-7356', '车门系统出现异常：代码F-7356。', '车门系统', '加改修', '进行中', '赵六', '2025-07-08 06:53:00', '赵六反馈车门系统波动，需加改修处理。', '唐山检修库B', '信号维护组', '刘工', '13800000023', '2025-06-03 06:53:00', NULL, NULL, '2025-07-08 10:43:00', '2025-07-08 08:19:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (16, '2025-09-08_TSY_0402_A', 'CR400BF-2035', '13车', 900015, 'RM-2025-900015', 'F-4006', '车载网络出现异常：代码F-4006。', '车载网络', '定检', '进行中', '王五', '2025-06-12 09:49:00', '王五反馈车载网络波动，需定检处理。', '唐山检修库B', '转向架二班', '王工', '13800000028', '2025-03-29 09:49:00', NULL, NULL, '2025-06-12 11:07:00', '2025-06-12 10:46:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (17, '2025-09-08_TSY_0402_A', 'CRH380A-2058', '07车', 900016, 'RM-2025-900016', 'F-5178', '制动管路出现异常：代码F-5178。', '制动管路', '定检', '进行中', '杨五', '2025-06-12 06:01:00', '杨五反馈制动管路波动，需定检处理。', '沈阳检修库', '转向架二班', '赵工', '13800000022', '2025-06-01 06:01:00', NULL, NULL, '2025-06-12 08:24:00', '2025-06-12 07:24:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (18, '2025-09-08_TSY_0402_A', 'CR400AF-2006', '15车', 900017, 'RM-2025-900017', 'F-8767', '车载网络出现异常：代码F-8767。', '车载网络', '加改修', '已完成', '周九', '2025-07-02 04:04:00', '周九反馈车载网络波动，需加改修处理。', '沈阳检修库', '转向架二班', '何工', '13800000026', '2025-04-23 04:04:00', 1, '2025-07-02 09:31:00', '2025-07-02 04:57:00', '2025-07-02 04:38:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (19, '2025-09-08_TSY_0402_A', 'CR400AF-2026', '05车', 900018, 'RM-2025-900018', 'F-8041', '空调系统出现异常：代码F-8041。', '空调系统', '加改修', '进行中', '刘三', '2025-06-16 03:28:00', '刘三反馈空调系统波动，需加改修处理。', '上海检修库', '转向架二班', '钱工', '13800000029', '2025-05-02 03:28:00', NULL, NULL, '2025-06-16 06:22:00', '2025-06-16 03:58:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (20, '2025-09-08_TSY_0402_A', 'CR200J-2004', '11车', 900019, 'RM-2025-900019', 'F-9763', '牵引系统出现异常：代码F-9763。', '牵引系统', '定检', '已取消', '陈四', '2025-06-05 07:53:00', '陈四反馈牵引系统波动，需定检处理。', '线路应急库', '空调保养班', '钱工', '13800000023', '2025-03-25 07:53:00', 2, NULL, '2025-06-05 09:33:00', '2025-06-05 08:45:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (21, '2025-09-08_TSY_0402_A', 'CR400BF-2027', '10车', 900020, 'RM-2025-900020', 'F-7182', '车载网络出现异常：代码F-7182。', '车载网络', '临修', '已完成', '赵六', '2025-08-05 09:10:00', '赵六反馈车载网络波动，需临修处理。', '唐山检修库A', '牵引系统班', '周工', '13800000028', '2025-06-16 09:10:00', 1, '2025-08-05 13:05:00', '2025-08-05 11:50:00', '2025-08-05 10:08:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (22, '2025-09-08_TSY_0402_A', 'CRH6A-2054', '05车', 900021, 'RM-2025-900021', 'F-2886', '信号通信出现异常：代码F-2886。', '信号通信', '定检', '已完成', '王二', '2025-06-14 03:22:00', '王二反馈信号通信波动，需定检处理。', '线路应急库', '车门检修班', '王工', '13800000021', '2025-03-26 03:22:00', 1, '2025-06-14 13:11:00', '2025-06-14 06:06:00', '2025-06-14 04:45:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (23, '2025-09-08_TSY_0402_A', 'CRH380A-2075', '03车', 900022, 'RM-2025-900022', 'F-8963', '车门系统出现异常：代码F-8963。', '车门系统', '临修', '已完成', '郑一', '2025-07-19 01:25:00', '郑一反馈车门系统波动，需临修处理。', '上海检修库', '制动一班', '钱工', '13800000027', '2025-04-20 01:25:00', 1, '2025-07-19 09:29:00', '2025-07-19 04:04:00', '2025-07-19 01:46:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (24, '2025-09-08_TSY_0402_A', 'CRH6A-2031', '04车', 900023, 'RM-2025-900023', 'F-5121', '转向架系统出现异常：代码F-5121。', '转向架系统', '临修', '已完成', '杨五', '2025-08-12 06:52:00', '杨五反馈转向架系统波动，需临修处理。', '线路应急库', '信号维护组', '李工', '13800000028', '2025-06-06 06:52:00', 1, '2025-08-12 10:17:00', '2025-08-12 08:04:00', '2025-08-12 07:31:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (25, '2025-09-08_TSY_0402_A', 'CR400AF-2020', '04车', 900024, 'RM-2025-900024', 'F-8213', '信号通信出现异常：代码F-8213。', '信号通信', '临修', '已取消', '王二', '2025-09-02 03:07:00', '王二反馈信号通信波动，需临修处理。', '上海检修库', '牵引系统班', '郝工', '13800000027', '2025-07-09 03:07:00', 2, '2025-09-02 04:11:00', '2025-09-02 04:11:00', '2025-09-02 03:55:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (26, '2025-09-08_TSY_0402_A', 'CR200J-2066', '16车', 900025, 'RM-2025-900025', 'F-3787', '牵引系统出现异常：代码F-3787。', '牵引系统', '临修', '进行中', '张三', '2025-06-05 08:11:00', '张三反馈牵引系统波动，需临修处理。', '成都检修库', '空调保养班', '何工', '13800000027', '2025-05-22 08:11:00', NULL, NULL, '2025-06-05 11:26:00', '2025-06-05 09:04:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (27, '2025-09-08_TSY_0402_A', 'CRH6A-2088', '13车', 900026, 'RM-2025-900026', 'F-6843', '牵引系统出现异常：代码F-6843。', '牵引系统', '加改修', '已完成', '赵六', '2025-08-02 10:06:00', '赵六反馈牵引系统波动，需加改修处理。', '广州检修库B', '车门检修班', '赵工', '13800000028', '2025-06-04 10:06:00', 1, '2025-08-02 16:32:00', '2025-08-02 13:31:00', '2025-08-02 11:16:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (28, '2025-09-08_TSY_0402_A', 'CRH380A-2043', '08车', 900027, 'RM-2025-900027', 'F-9007', '制动系统出现异常：代码F-9007。', '制动系统', '加改修', '已取消', '陈四', '2025-07-28 01:05:00', '陈四反馈制动系统波动，需加改修处理。', '上海检修库', '信号维护组', '何工', '13800000022', '2025-07-17 01:05:00', 2, '2025-07-28 02:02:00', '2025-07-28 02:02:00', '2025-07-28 01:52:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (29, '2025-09-08_TSY_0402_A', 'CR200J-2004', '04车', 900028, 'RM-2025-900028', 'F-7940', '信号通信出现异常：代码F-7940。', '信号通信', '定检', '已取消', '王五', '2025-08-15 07:45:00', '王五反馈信号通信波动，需定检处理。', '线路应急库', '牵引系统班', '王工', '13800000029', '2025-07-18 07:45:00', 2, '2025-08-15 09:17:00', '2025-08-15 09:17:00', '2025-08-15 08:00:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');
INSERT INTO `dm_topic0402_input_train_maintenance` VALUES (30, '2025-09-08_TSY_0402_A', 'CR400BF-2005', '07车', 900029, 'RM-2025-900029', 'F-5497', '牵引系统出现异常：代码F-5497。', '牵引系统', '加改修', '已取消', '李四', '2025-07-26 07:26:00', '李四反馈牵引系统波动，需加改修处理。', '唐山检修库B', '空调保养班', '何工', '13800000021', '2025-07-08 07:26:00', 2, NULL, '2025-07-26 09:52:00', '2025-07-26 07:39:00', '系统', '2025-09-11 13:49:13', 0, '批量测试', -1, '', '2025-09-11 13:49:13', -1, '');

SET FOREIGN_KEY_CHECKS = 1;
